Repository: Roberdan/PermissionsManagerSwiftUI
Catalog: Sources/PermissionsManager/Resources/*.lproj/Localizable.strings
Languages: fi, th, vi

# ThisAppNameString
source: This application
fi: Tämä sovellus
th: แอปพลิเคชันนี้
vi: Ứng dụng này

# NotDeterminedLocalized
source: Not determined
fi: Ei määritetty
th: ไม่ได้กำหนด
vi: Chưa xác định

# DeniedLocalized
source: Denied
fi: Edelty
th: ถูกปฏิเสธ
vi: Bị từ chối

# AuthorizedLocalized
source: Authorized
fi: Valtuutettu
th: ได้รับอนุญาต
vi: Được ủy quyền

# UnknownLocalized
source: Unknown
fi: Tuntematon
th: ไม่รู้จัก
vi: Không xác định

# NotAvailableLocalized
source: Not available
fi: Ei saatavilla
th: ไม่พร้อมใช้งาน
vi: Không có sẵn

# PermissionsManagerErrorTypeDoesNotExistLocalized
source: Permissions Manager Error: permission type does not exist
fi: Käyttöoikeuksien hallinnan virhe: käyttöoikeustyyppiä ei ole olemassa
th: ข้อผิดพลาดของตัวจัดการสิทธิ์: ไม่มีประเภทการอนุญาต
vi: Lỗi Trình quản lý quyền: loại quyền không tồn tại

# CameraLocalized
source: Video camera
fi: Videokamera
th: กล้องวิดีโอ
vi: Máy quay phim

# CriticalNotificationsLocalized
source: Critical Notifications
fi: Kriittiset ilmoitukset
th: การแจ้งเตือนที่สำคัญ
vi: Thông báo quan trọng

# NotificationsLocalized
source: Notifications
fi: Ilmoitukset
th: การแจ้งเตือน
vi: Thông báo

# HealthDataLocalized
source: Health Data
fi: Terveystiedot
th: ข้อมูลสุขภาพ
vi: Dữ liệu sức khỏe

# MicrophoneLocalized
source: Microphone
fi: Mikrofoni
th: ไมโครโฟน

# SpeechRecognitionLocalized
source: Speech Recognition
fi: Puheentunnistus
th: การรู้จำเสียง
vi: Nhận dạng giọng nói

# OKMessageLocalized
source: Thank you!
fi: Kiitos!
th: ขอบคุณ!
vi: Cảm ơn!

# RecoveryMsgLocalizePart1
source: Please go on iPhone settings, and look for
fi: Siirry iPhonen asetuksiin ja etsi
th: โปรดไปที่การตั้งค่า iPhone และมองหา
vi: Vui lòng vào cài đặt iPhone và tìm kiếm

# DescriptionMsgPart1
source: Enabling
fi: Otetaan käyttöön
th: เปิดใช้งาน
vi: Đang kích hoạt

# DescriptionMsgPart2
source: is essential for this app to work correctly.
fi: on välttämätöntä, jotta tämä sovellus toimii oikein.
th: จำเป็นสำหรับแอปนี้ในการทำงานอย่างถูกต้อง
vi: cần thiết để ứng dụng này hoạt động bình thường.

# NoOkMessagePart1
source: You did not granted access to
fi: Et antanut käyttöoikeutta
th: คุณไม่ได้รับอนุญาตให้เข้าถึง
vi: Bạn không cấp quyền truy cập

# NoOkMessagePart2
source: and so I can't work correctly. I'm sorry.
fi: enkä siksi voi toimia oikein. Olen pahoillani.
th: ฉันจึงทำงานไม่ถูกต้อง ฉันขอโทษ
vi: và vì vậy tôi không thể làm việc chính xác. Tôi xin lỗi.

# RecoveryMsgLocalizePart2
source: and grant all required permissions. Thank you.
fi: ja anna kaikki vaaditut käyttöoikeudet. Kiitos.
th: และให้สิทธิ์ที่จำเป็นทั้งหมด ขอบคุณ
vi: và cấp tất cả các quyền cần thiết. Xin cảm ơn.

# AuthCheckPointTitle
source: Authorizations check
fi: Valtuutusten tarkistus
th: การตรวจสอบสิทธิ์
vi: Kiểm tra ủy quyền

# GrantItBtnLabel
source: Grant it
fi: Anna se
th: อนุญาต
vi: Cấp cho nó

# SomeMissingAuthNeeded
source: Some authorizations are still needed for the app to work correctly. Please grant them all. If you need any help send an email to:
fi: Jotkin valtuutukset tarvitaan vielä, jotta sovellus toimii oikein. Myönnä ne kaikki. Jos tarvitset apua, lähetä sähköpostia osoitteeseen:
th: การอนุญาตบางอย่างยังจำเป็นเพื่อให้แอปทำงานได้อย่างถูกต้อง โปรดอนุญาตทั้งหมด ถ้าคุณต้องการความช่วยเหลือใดๆ ให้ส่งอีเมลไปที่:
vi: Một số ủy quyền vẫn cần thiết để ứng dụng hoạt động chính xác. Vui lòng cấp tất cả. Nếu bạn cần bất kỳ trợ giúp nào, hãy gửi email tới:

# MandatoryMsg
source: Mandatory
fi: Pakollinen
th: จำเป็น
vi: Bắt buộc

# SkipMsgText
source: Skip
fi: Ohita
th: ข้าม
vi: Bỏ qua
